# ColorFillSchemeEntry Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorFillSchemeEntry Properties
ColorFillSchemeEntry Class See Also
---
The ColorFillSchemeEntry type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Caption | The text displayed in [!:Autodesk::Revit::DB::ColorFillLegend] for this entry. |
| Color | The filling color of this entry. |
| FillPatternId | The id of fill pattern element of this entry. |
| IsInUse | Represents if there exists at least one element colored based on this entry in the document. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| IsVisible | Represents if the element colored based on this entry is visible in views. |
| StorageType | The storage type of the value stored in this entry. |

# See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace